app/views/users/index.html.erb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
<h1>All Users</h1>
<h3><%= User.count%> users have sign up in this platform</h3>