app/views/songs/_form.html.erb

SELECT "playlists"."id" FROM "playlists" INNER JOIN "playlists_songs" ON "playlists"."id" = "playlists_songs"."playlist_id" WHERE "playlists_songs"."song_id" = $1  [["song_id", 39]]
---
    <%= f.label :playlist_id%>
    <%= f.select :playlist_ids, Playlist.pluck(:name, :id), :include_blank => true%>