app/controllers/playlists_controller.rb

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
---
  def show
    @playlist = Playlist.find params[:id]

SELECT "playlists".* FROM "playlists"
---
  def index
    @playlists = Playlist.all

INSERT INTO "playlists" ("name", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    playlist = Playlist.create playlist_params

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
---
  def edit
    @playlist = Playlist.find params[:id]

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
UPDATE "playlists" SET "song_id" = $1, "updated_at" = $2 WHERE "playlists"."id" = $3  [["song_id", 43], ["updated_at", "2021-10-26 01:03:51.306118"], ["id", 43]]
---
  def update
    playlist = Playlist.find params[:id]
    playlist.update playlist_params