app/controllers/songs_controller.rb

    def search
        @songs = Song.where("name LIKE ?", "%" + params[:q] + "%")
---
SELECT "songs".* FROM "songs" WHERE (name LIKE '%Atish%')

    def create
        song = Song.create song_params
---
INSERT INTO "songs" ("name", "genre", "artist", "created_at", "updated_at", "track") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def edit
        @song = Song.find params[:id]
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]

    def update
        song = Song.find params[:id]
        song.update song_params
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
UPDATE "songs" SET "name" = $1, "genre" = $2, "artist" = $3, "track" = $4, "updated_at" = $5 WHERE "songs"."id" = $6

    def destroy
        song = Song.find params[:id]
        song.destroy
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 38]]