app/views/playlists/_form.html.erb


    <%= f.collection_check_boxes :song_ids, Song.all, :id,:name do |b|%>
---
SELECT "songs"."name", "songs"."id" FROM "songs"