app/views/playlists/_form.html.erb

SELECT "songs"."id" FROM "songs" INNER JOIN "playlists_songs" ON "songs"."id" = "playlists_songs"."song_id" WHERE "playlists_songs"."playlist_id" = $1  [["playlist_id", 44]]
---
    <%= f.label :song%>
    <%= f.select :song_ids, Song.pluck(:name, :id), :include_blank => true%>