app/views/playlists/index.html.erb

<h1>All playlists</h1>
<%if @current_user.playlists.present?%>
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = $1  [["user_id", 53]]