app/views/playlists/show.html.erb

<div class="playlist_songs_list">
<% @playlist.songs.each do |song|%>
---
SELECT "songs".* FROM "songs" INNER JOIN "playlists_songs" ON "songs"."id" = "playlists_songs"."song_id" WHERE "playlists_songs"."playlist_id" = $1  [["playlist_id", 43]]